{"data":{"markdownRemark":{"html":"<p>This guide will help you to understand data models used in the Platform of Trust. Data integrator's most likely will need to understand this part thoroughly to be able to build translation rules between source data and platform of trust with Translator component or integration platform tools. </p>\n<h2>Purpose and benefits</h2>\n<p>Unification of data models enables easy integration without need to build connectors for each specific case.\nPlatform of Trust data models are available in machine readable <a href=\"https://json-ld.org/\">JSON-LD</a> encoding and utilizes <a href=\"https://www.w3.org/RDF/\">RDF</a> standard. Other encodings might be available at later stages. Data model can be easily extended by third parties.</p>\n<h2>Data example</h2>\n<p>Each data file of identity should reference context file. All properties excluding <code>name</code> should be nested under <code>data</code> object. Here is example of Building</p>\n<pre><code class=\"language-JSON\">{\n    \"@context\": \"https://platformoftrust.github.io/standards/contexts/identity-building.jsonld\",\n    \"@id\": \"&#x3C;identity id>\",\n    \"@type\": \"Building\",\n    \"name\": \"Houmenta\",\n    \"data\": {\n        \"lifeCycleInaugurationMomentYear\": 1943,\n        \"lifecycleInspectionYear\": 2017,\n        \"physicalAreaSquareMeterNet\": 5200,\n        \"physicalVolumeCubic\": 40000\n    }\n}\n</code></pre>\n<p>In this example <code>@context</code> defines reference to Context file where definition of JSON sctructure is located. In this definition there is a reference to Ontology file with term definitions. <a href=\"https://json-ld.org/playground/\">JSON-LD playground</a> can be used to extract machine readable definition of data. Just copypaste above example there to receive terms links.</p>\n<p>Please reference sections below to get more information about Ontology and Context terms</p>\n<h2>Data model</h2>\n<p>Data model include real life objects and their properties.\nWe have a set of classes, arranged in a multiple inheritance hierarchy where each class may be a sub-class of multiple classes.\nWe also have a set of properties:</p>\n<ul>\n<li>each property may have one or more classes as its domains. The property may be used for instances of any of these classes.</li>\n<li>each property may have one or more classes as its ranges. The value(s) of the property should be instances of at least one of these classes.</li>\n<li>can be arranged in hierarchy same as classes.</li>\n</ul>\n<p>The decision to allow multiple domains and ranges was purely pragmatic. While the computational properties of systems with a single domain and range are easier to understand, in practice, this forces the creation of a lot of artifical classes, which are there purely to act as the domain/range of some properties.</p>\n<p>All classes and properties can be investigated in <a href=\"https://platformoftrust.github.io/standards/\">Data Model structure documentation</a>.</p>\n<h2>Data model source code</h2>\n<p>Data model source code is organized in following way:</p>\n<ul>\n<li>Core ontology file is named <code>pot.jsonld</code> and is located under <code>ontologies</code> folder. It contains all classes and properties used in ontology</li>\n<li>Context files are located in <code>contexts</code> folder and contains one file per identity. This file describes JSON document sctructure of specific identity.</li>\n<li>Vocab files are located in <code>vocabularies</code> folder and describes properties metadata like labels on forms and requirements</li>\n</ul>\n<p>Core ontology should be understood as core terms vocabulary including all classes and properties. Context files define JSON document strcuture and are connected to ontology. Vocab files should be used to build UI and other application level represetations of data structure and also to understand some technical level properties of attributes.</p>\n<p>All JSON-LD source files are available under <a href=\"https://github.com/PlatformOfTrust/standards\">GitHub Repository</a>.</p>\n<h2>Links and additional information</h2>\n<p>All classes and properties can be investigated in <a href=\"https://platformoftrust.github.io/standards/\">Data Model structure documentation</a>.</p>\n<p>All JSON-LD source files are available under <a href=\"https://github.com/PlatformOfTrust/standards\">GitHub Repository</a>.</p>\n<p>If you are application developer, it might be a good idea to read <a href=\"/developers/getstarted/build-apps\">Application Development Guide</a> first. </p>\n<p>If you are integrating data and creating data products, take a look at the <a href=\"/developers/getstarted/data-products\">Data Product Guide</a>. </p>\n<p>Digital Twins are fundamental features of the platform, take a look at the <a href=\"/developers/getstarted/twins\">Digital Twin Guide</a>.</p>\n<p>Open sandbox is your friend! Isolated environment for testing applications and data product integrations, read more from <a href=\"/developers/getstarted/sandbox\">Sandbox Guide</a>.</p>","frontmatter":{"date":"January 15, 2019","path":"/getstarted/data-models","title":"How to use standard data models","image":null}}},"pageContext":{}}