{"data":{"markdownRemark":{"html":"<p>The Platform of Trust Sandbox environment is intended to be used by developers to test their applications and data product integrations, prior to production, in a safe and isolated manner.</p>\n<p>The environment should be used for test data only, but will run the same version of the software as production.</p>\n<h2>Periodic environment reset</h2>\n<p>For things to keep in mind when working with sandbox is that we do NOT guarantee that the data in the database stays intact, and instead we guarantee that it will be regularly reset and your data WILL be lost.</p>\n<h2>Sample data and integrations</h2>\n<p>For your own integrations to the sandbox environment it is recommended that you also use purely test data with no sensitive information, as other people also use the environment and your data might be viewed by other people as well. This is especially important in case of data products, as during development your access control checks etc. might not be fully complete.</p>\n<p>It is recommended that when you are integrating a data product, that you use a separate \"sandbox\" deployment for yourself as well. This way you can keep working on the \"development version\" that is tied to sandbox, while you have a stable production version deployed as well.</p>\n<h2>APIs in sandbox</h2>\n<p>The sandbox APIs and other URLs can be identified with the <code>*-sandbox.oftrust.net</code> -domain, so e.g. all the APIs for managing your data products etc. are under <code>api-sandbox.oftrust.net</code>. </p>\n<h1>Create account and get started!</h1>\n<p>Create account and start utilizing the free and open sandbox! </p>\n<p>If you are application developer, it might be a good idea to read <a href=\"/developers/getstarted/build-apps\">Application Development Guide</a> first. </p>\n<p>If you are integrating data and creating data products, take a look at the <a href=\"/developers/getstarted/data-products\">Data Product Guide</a>. </p>\n<p>Digital Twins is fundamental feature of the platform, take a look at the <a href=\"/developers/getstarted/twins\">Digital Twin Guide</a>.</p>","frontmatter":{"date":"January 15, 2019","path":"/developers/getstarted/sandbox","title":"Open Platform of Trust Sandbox","image":null}}},"pageContext":{}}